#1) запрашивает у пользователя температуру в градусах цельсия и выводит сообщения тепло или холодно, если
# на улице ниже нуля или выше.

# temperature = int(input('Введите температуру в градусах Цельсия: '))
# if temperature > 0:
#     print('На улице тепло')
# else:
#     print('На улице холодно')

# 2) Программа, которая принимает от пользователя 2 целых числа, и определяет, является ли первое кратно второму

# numb1 = int(input('Введите 1е число: '))
# numb2 = int(input('Введите 2е число: '))
# if numb1 % numb2 == 0:
#     print('1е число кратно 2му')
# else:
#     print('1е число не кратно 2му')

# 3) Программа, которая запрашивает от пользователя целое число и проверяет, является ли число положительным,
# отрицательным или это 0

# number = int(input('Введите целое число: '))
# if number > 0:
#     print('Это число положительное')
# elif number < 0:
#     print('Это число отрицательное')
# else:
#     print('Это число равно нулю')

# 4) Введите число. Если это число делиться на 1000 без остатка, то выведите на экран "millennium"

# number = float(input('Введите число: '))
# if number % 1000 == 0:
#     print('millennium')
# else:
#     print('Число не делится на 1000 без остатка')

# 5) Обеспечить ввод имени, причем чтобы оно было больше 3, но меньше 50 символов

# name = input('Введите имя: ')
# leng_name = len(name)
# if leng_name > 3 and leng_name < 50:
#     print('Имя введено верно')
# else:
#     print('Имя введено неверно')