# 1.	Какой тип данных используется для хранения целых чисел в Python?
# a. int

# 2.	Какой тип данных используется для хранения вещественных чисел в Python?
# b. float

# 3.	Какой тип данных используется для хранения строк в Python?
# c. str

# 4.	Какая операция используется для объединения двух строк в Python?
# a. +

# 5.	Какой оператор используется для проверки равенства значений в Python?
# b. ==

# 6.	Какой оператор используется для проверки больше или меньше значения в Python?
# d. <>

# 7.	Какой оператор используется для проверки, входит ли элемент в список в Python?
# c. both a and b

# 8.	Какой оператор используется для проверки, является ли элемент частью строки в Python?
# c. both a and b

# 9.	Какой оператор используется для создания условия if в Python?
# a. if

# 10.	Какой оператор используется для выхода из цикла в Python?
#  a. break

# 11.	Какой оператор используется для продолжения выполнения цикла в Python?
# b. continue

# 12.	Какой оператор используется для получения элемента списка по индексу в Python?
# b. index()

# 13.	Какой оператор используется для добавления элемента в конец списка в Python? a. add()
# c. append()

# 14.	Какой оператор используется для удаления элемента из списка в Python?
# b. remove()

# 15.	Какой оператор используется для получения длины списка в Python?
# d. len()

# 16. Что будет результатом программы и почему?
# 	x = 4.5
# y = 2
# print(x // y)
# >> 2.0, так как оператор '//' это целочисленное деление, возвращает целую часть результата

# 17. Какая будет итоговая длина списка и почему?
# a = [1 ,2 ,3, None, (), [] , ]
# print(len(a))
# >> Длина списка будет 6, т.к. здесь 6 объектов данных

# 18.	Какой будет результат программы?
# x = True
# y = False
# z = False
# if not x or y:
#     print(1)
# elif not x or not y and z:
#     print(2)
# elif not x or y or not y and x:
#     print(3)
# else:
#     print(4)
# >>> 3, так как это значение возвращает True

# 19.	Что выведет следующий код, при его исполнении?
# print(type(1 / 2))
# >> class ‘float’

# 20.	Какие из приведенных ниже имен переменных не корректны?
# a. my-var
# d. _myvar






