# Написать программу, которая принимает строку от пользователя, и выводит все ее слова в обратном порядке
s1 = input('Enter a string: ')
new_s1 = s1[::-1]
print(new_s1)