# Напишите программу, которая запрашивает имя у пользователя
# затем выводит строку "Привет, ...", где вместо многоточия имя пользователя
# Вторая строка выведет имя пользователя с повтором в 3 раза
name = input('Enter your name: ')
greeting = 'Привет, '
print(greeting + name)
st2 = name * 3
print(st2)